renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_initialize.c
    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmem_init_rca() */

/**********************************************************************************************************************
* Outline      : Mount SD Memory Card
* Function Name: r_sdc_sdmem_mount
* Description  : Mounts the SD Memory and sets it from stand-by to transfer state.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_mount(uint32_t card_no)
{
    sdc_sd_hndl_t  * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Change the clock (data-transfer ratio). ---- */
    if (SDC_SD_CLK_25MHz <= p_hndl->csd_tran_speed)
    {
        p_hndl->mem_tran_speed = r_sdc_sd_get_div_default_speed();
    }
    else
    {
        /* NOP */
    }
    if (R_SDHI_SetClock(p_hndl->channel, p_hndl->mem_tran_speed, SDHI_CLOCK_ENABLE) != SDHI_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
        return p_hndl->error;
    }

    /* ==== Check the status precede read operation. ==== */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD13, SDC_SD_RESP_R1, p_hndl->rca[0]) != SDC_SD_SUCCESS)
    {
        if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD13, SDC_SD_RESP_R1, p_hndl->rca[0]) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }
    }

    /* ==== Data-transfer mode (Transfer State) ==== */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD7, SDC_SD_RESP_R1b, p_hndl->rca[0]) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return p_hndl->error;
    }

    if (p_hndl->resp_status & SDC_SD_RES_CARD_IS_LOCKED)
    {
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_CARD_LOCK);
        return SDC_SD_SUCCESS;
    }

    /* ---- Set the block length. (Issue CMD16.) ---- */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD16, SDC_SD_RESP_R1, SDC_SD_TRANS_BLOCK_SIZE) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return p_hndl->error;
    }

    /* If 4bits transfer is supported (SD Memory card mandatory), change to the 4bits bus width. */
    if (p_hndl->media_type & SDC_SD_MEDIA_SDMEM)
    {
        if (r_sdc_sdmem_set_port(card_no, p_hndl->sup_if_mode) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return SDC_SD_ERR;
        }

        if (SDC_SD_MODE_1BIT == p_hndl->sup_if_mode)
        {
            R_SDHI_SetBus(p_hndl->channel, SDHI_PORT_1BIT);
        }
        else
        {
            R_SDHI_SetBus(p_hndl->channel, SDHI_PORT_4BIT);
        }

        /* Clear the pull-up DAT3. */
        if (r_sdc_sd_send_acmd(card_no, SDC_SD_ACMD42, 0) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }
        /* Check the R1 response. */
        if (r_sdc_sd_get_resp(card_no, SDC_SD_RESP_R1) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }
        /* Get the SD Status. */
        if (r_sdc_sdmem_card_get_sdstatus(card_no) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }
        /* Get the protect area size. */
        if (r_sdc_sd_get_size(card_no, SDC_SD_PROT_AREA) != SDC_SD_SUCCESS)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
            return p_hndl->error;
        }
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sdmem_mount() */

/**********************************************************************************************************************
* Outline      : Get SD Status
* Function Name: r_sdc_sdmem_card_get_sdstatus
* Description  : Gets the SD Status using ACMD13.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_card_get_sdstatus(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    sdc_sd_status_t   ret = SDC_SD_SUCCESS;
    int32_t         i = 0;
    uint8_t         * p_rw_buff = 0;

    p_rw_buff = (uint8_t *)&g_sdc_sdmem_stat_buff[0];

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Get SD Status using ACMD13. ---- */
    if (r_sdc_sdmem_read_byte(card_no, SDC_SD_ACMD13, 0, p_rw_buff, SDC_SD_STATUS_BYTE) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return SDC_SD_ERR;
    }

    /* ---- Save SD STATUS. ---- */
    /* Expand the SD STATUS relevant fields. */
    for (i = 0 ; i < 4 ; i++)
    {
#if (SDC_SD_BIG_ENDIAN)
        p_hndl->sdstatus[i] = g_sdc_sdmem_stat_buff[i];
#else
        p_hndl->sdstatus[i] = revl(g_sdc_sdmem_stat_buff[i]);
#endif
    }

    /* ---- Distinguish the SD ROM card. ---- */
    if (0x00 == (p_hndl->sdstatus[0] & SDC_SD_STATUS_SD_CARD_TYPE_UPPER))
    {
        ret = SDC_SD_SUCCESS;
        if (0x01 == (p_hndl->sdstatus[0] & SDC_SD_STATUS_SD_CARD_TYPE_LOWER))
        {
            p_hndl->write_protect = (p_hndl->write_protect | SDC_SD_WP_ROM);
        }
    }
    else
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        ret = SDC_SD_ERR;
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_CARD_ERROR);
    }

    p_hndl->speed_class = (uint8_t)((p_hndl->sdstatus[2] & SDC_SD_STATUS_SPEED_CLASS) >> SDC_SD_BIT_SHIFT_24);
    p_hndl->perform_move = (uint8_t)((p_hndl->sdstatus[2] & SDC_SD_STATUS_PERFORMANCE_MOVE) >> SDC_SD_BIT_SHIFT_16);

    return ret;
} /* End of function r_sdc_sdmem_card_get_sdstatus() */

/**********************************************************************************************************************
* Outline      : Get SCR Register
* Function Name: r_sdc_sdmem_card_get_scr
* Description  : Gets the SCR register using ACMD51.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_card_get_scr(uint32_t card_no)
{
    sdc_sd_hndl_t   * p_hndl = 0;
    int32_t           i = 0;
    uint8_t         * p_rw_buff = 0;

    p_rw_buff = (uint8_t *)&g_sdc_sdmem_stat_buff[0];

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Get SCR register using ACMD51. ---- */
    if (r_sdc_sdmem_read_byte(card_no, SDC_SD_ACMD51, 0, p_rw_buff, SDC_SD_SCR_REGISTER_BYTE) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_INITIALIZE, __LINE__);
        return SDC_SD_ERR;
    }

    /* ---- Save SCR register. ---- */
    for (i = 0 ; i < 2 ; i++)
    {
#if (SDC_SD_BIG_ENDIAN)
        p_hndl->scr[i] = g_sdc_sdmem_stat_buff[i];
#else
        p_hndl->scr[i] = revl(g_sdc_sdmem_stat_buff[i]);
#endif
    }

